doc/parser-combinators.org
#+TITLE: parser-combinators documentation
#+AUTHOR: Jakub Higersberger
#+EMAIL: ramarren@gmail.com
* Introductory notes

The =parser-combinators= library is a library implementing monadic parser combinators in Common Lisp, similar in concept to Haskell Parsec system. It does not include advanced optimizations and error handling routines, since those require transforming the generated parsers into LL(1) form while retaining as much generality as possible, which is beyond the ambitions of this project. The usage patterns are also somewhat different due to Common Lisp being less focused on functional approach and eager semantics.

Master repository is on [[https://github.com/Ramarren/cl-parser-combinators/][GitHub/Ramarren/cl-parser-combinators]]. Note that system name is =parser-combinators=, without the =cl= prefix. It can be obtained by checking it out using [[http://git-scm.com/][git]] or downloading an automatic [[http://github.com/Ramarren/cl-parser-combinators/tarball/master][tarball]]. Refer to [[http://common-lisp.net/project/asdf/asdf/][ASDF]] manual how to make the system locatable and load it. All dependencies are available in [[http://www.quicklisp.org/][quicklisp]], and hopefully this system will become available the in the future.

All questions and comments are welcome. If you have any please email me at [[mailto:ramarren@gmail.com][ramarren@gmail.com]].

* Tutorial

In general, a parser is a program that transforms a linear sequence of tokens into a complex, usually hierarchical representation. Parser combinators allow construction of more complex parsers from simple parsers, which allows the parsing problem to be decomposed into small units, making it easier to write, test and maintain. Monadic parser combination allows handling arbitrary context-free grammars through backtracking and generating parsers depending on results of other parsers.

An important point is that due to the necessity of backtracking, the input sequence must be entirely in memory. Parsing streams is impossible. Lazy sequences are in principle possible, with some caveats, but not implemented. The input sequence can be a list or a vector of arbitrary elements. The focus is on strings (vectors of characters), but the system will work as well on, for example, a vector of bytes or a list of structured tokens, like a result of a lexing pass.

Note: Most mentioned functions have their own documentation strings. I don't duplicate those details and argument lists here.

** Using parsers

The most common entry point for parsing is the =parse-string*= function. It is a specialized form of =parse-string= which will return a single parse result, which is the usual requirement. The more general form is useful mostly if the grammar is ambiguous and obtaining all possible parsers for external postprocessing is required.

The =parse-string*= function takes as an arguments a parser and a sequence. It also takes a =&key= argument =:complete=, which, if =t=, means that only a parse that consumes all the input is considered a success, and the parser will be backtracked until such a result is found or it fails. It returns multiple values. The primary is the parsing result, the secondary indicates whether it was incomplete, third if it was successful (in case =NIL=, which is normally returned on failure, can also be a result of the parse) and finally an object which registers additional state indicating where the parsing stopped if it was incomplete or failed.

A result of a parser can be an arbitrary object. But, since the parsing process involves backtracking and a certain degree of lazy evaluation, using mutation of objects or global environment is not reliable. If creation of more complex objects during parsing is desired a functional datastructres library is necessary. This is especially important when dealing with cross-cutting references, which might require holding a significant amount of transient state before they are merged at higher level.

** Elementary parsers

The most basic parsers are literal parsers. A literal or a sequence, passed where a parser is expected[fn:1], will create a parser which matches that object literally. This gives the most trivial example:

[fn:1] In this system a parser is a function, and there is no way to differentiate a non-parser function from a parser function. So literal function objects cannot be matched this way.

#+BEGIN_EXAMPLE
CL-USER> (parse-string* "ABC" "ABC")
"ABC"
NIL
T
NIL
CL-USER> (parse-string* "ABC" '(#\A #\B #\C))
"ABC"
NIL
T
NIL
CL-USER> (parse-string* "ABC" "ABD")
NIL
NIL
NIL
#<PARSER-COMBINATORS::CONTEXT-FRONT {AAAB041}>
#+END_EXAMPLE

The parser created from the string "ABC" matches a string "ABC", as well as a list of it's characters, but doesn't match a different string.

Most other parsers are obtained by calling parser generating functions[fn:2]. Conventionally most of these functions included in this library end either a question mark or a star. The former are fully backtracking, while the latter don't backtrack, in order to obtain additional performance if the grammar is known to be unambiguous. There are some exceptions, most notably =sat=, which takes a predicate and returns a parsers which accepts an item for which the predicate is true, and core combinators.

[fn:2] Since parsers are functions, and in SBCL at least it is not possible to have anonymous functions assigned to variables, even constant parsers are obtained this way.

** Core combinators

The most basic elements of any grammar are sequences and alternatives. While coming from Haskell/Parsec it might seem natural to use =bind= to express the former, it is usually an overkill and due to more verbose lambda syntax in Common Lisp it is fairly clunky. For this reason =bind= is not part of the exported interface.

