doc/parser-combinators.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>parser-combinators documentation</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-01-26 08:42:20 CET"/>
<meta name="author" content="Jakub Higersberger"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">parser-combinators documentation</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introductory notes </a></li>
<li><a href="#sec-2">2 Tutorial </a>
<ul>
<li><a href="#sec-2_1">2.1 Using parsers </a></li>
<li><a href="#sec-2_2">2.2 Elementary parsers </a></li>
<li><a href="#sec-2_3">2.3 Core combinators </a>
<ul>
<li><a href="#sec-2_3_1">2.3.1 Sequences </a></li>
<li><a href="#sec-2_3_2">2.3.2 Alternatives </a></li>
</ul>
</li>
<li><a href="#sec-2_4">2.4 Backtracking and ambiguity </a></li>
<li><a href="#sec-2_5">2.5 Repetition combinators </a></li>
<li><a href="#sec-2_6">2.6 Token parsers </a></li>
<li><a href="#sec-2_7">2.7 Structured repetition </a></li>
<li><a href="#sec-2_8">2.8 Finding </a></li>
<li><a href="#sec-2_9">2.9 Bulk repetition </a></li>
<li><a href="#sec-2_10">2.10 Chains </a></li>
<li><a href="#sec-2_11">2.11 Expressions </a></li>
<li><a href="#sec-2_12">2.12 Recursion and parser initialization </a></li>
</ul>
</li>
<li><a href="#sec-3">3 Other concepts </a>
<ul>
<li><a href="#sec-3_1">3.1 Primitive parsers </a></li>
<li><a href="#sec-3_2">3.2 Backtracking </a>
<ul>
<li><a href="#sec-3_2_1">3.2.1 Modifiers </a></li>
</ul>
</li>
<li><a href="#sec-3_3">3.3 Contexts </a>
<ul>
<li><a href="#sec-3_3_1">3.3.1 Context intervals </a></li>
</ul>
</li>
<li><a href="#sec-3_4">3.4 Error handling </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introductory notes </h2>
<div class="outline-text-2" id="text-1">


<p>
The <code>parser-combinators</code> library is a library implementing monadic parser combinators in Common Lisp, similar in concept to Haskell Parsec system. It does not include advanced optimizations and error handling routines, since those require transforming the generated parsers into LL(1) form while retaining as much generality as possible, which is beyond the ambitions of this project. The usage patterns are also somewhat different due to Common Lisp being less focused on functional approach and eager semantics.
</p>
<p>
Master repository is on <a href="https://github.com/Ramarren/cl-parser-combinators/">GitHub/Ramarren/cl-parser-combinators</a>. Note that system name is <code>parser-combinators</code>, without the <code>cl</code> prefix. It can be obtained by checking it out using <a href="http://git-scm.com/">git</a> or downloading an automatic <a href="http://github.com/Ramarren/cl-parser-combinators/tarball/master">tarball</a>. Refer to <a href="http://common-lisp.net/project/asdf/asdf/">ASDF</a> manual how to make the system locatable and load it. All dependencies are available in <a href="http://www.quicklisp.org/">quicklisp</a>, and hopefully this system will become available the in the future.
</p>
<p>
All questions and comments are welcome. If you have any please email me at <a href="mailto:ramarren@gmail.com">ramarren@gmail.com</a>.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Tutorial </h2>
<div class="outline-text-2" id="text-2">


<p>
In general, a parser is a program that transforms a linear sequence of tokens into a complex, usually hierarchical representation. Parser combinators allow construction of more complex parsers from simple parsers, which allows the parsing problem to be decomposed into small units, making it easier to write, test and maintain. Monadic parser combination allows handling arbitrary context-free grammars through backtracking and generating parsers depending on results of other parsers.
</p>
<p>
An important point is that due to the necessity of backtracking, the input sequence must be entirely in memory. Parsing streams is impossible. Lazy sequences are in principle possible, with some caveats, but not implemented. The input sequence can be a list or a vector of arbitrary elements. The focus is on strings (vectors of characters), but the system will work as well on, for example, a vector of bytes or a list of structured tokens, like a result of a lexing pass.
</p>
<p>
Note: Most mentioned functions have their own documentation strings. I don't duplicate those details and argument lists here.
</p>

</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3">2.1</span> Using parsers </h3>
<div class="outline-text-3" id="text-2_1">


<p>
The most common entry point for parsing is the <code>parse-string*</code> function. It is a specialized form of <code>parse-string</code> which will return a single parse result, which is the usual requirement. The more general form is useful mostly if the grammar is ambiguous and obtaining all possible parsers for external postprocessing is required.
</p>
<p>
The <code>parse-string*</code> function takes as an arguments a parser and a sequence. It also takes a <code>&amp;key</code> argument <code>:complete</code>, which, if <code>t</code>, means that only a parse that consumes all the input is considered a success, and the parser will be backtracked until such a result is found or it fails. It returns multiple values. The primary is the parsing result, the secondary indicates whether it was incomplete, third if it was successful (in case <code>NIL</code>, which is normally returned on failure, can also be a result of the parse) and finally an object which registers additional state indicating where the parsing stopped if it was incomplete or failed.
</p>
<p>
A result of a parser can be an arbitrary object. But, since the parsing process involves backtracking and a certain degree of lazy evaluation, using mutation of objects or global environment is not reliable. If creation of more complex objects during parsing is desired a functional datastructres library is necessary. This is especially important when dealing with cross-cutting references, which might require holding a significant amount of transient state before they are merged at higher level.
</p>
</div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2"><span class="section-number-3">2.2</span> Elementary parsers </h3>
<div class="outline-text-3" id="text-2_2">


<p>
The most basic parsers are literal parsers. A literal or a sequence, passed where a parser is expected<sup><a class="footref" name="fnr.1" href="#fn.1">1</a></sup>, will create a parser which matches that object literally. This gives the most trivial example:
</p>



<pre class="example">CL-USER&gt; (parse-string* "ABC" "ABC")
"ABC"
NIL
T
NIL
CL-USER&gt; (parse-string* "ABC" '(#\A #\B #\C))
"ABC"
NIL
T
NIL
CL-USER&gt; (parse-string* "ABC" "ABD")
NIL
NIL
NIL
#&lt;PARSER-COMBINATORS::CONTEXT-FRONT {AAAB041}&gt;
</pre>



<p>
The parser created from the string "ABC" matches a string "ABC", as well as a list of it's characters, but doesn't match a different string.
</p>
<p>
Most other parsers are obtained by calling parser generating functions<sup><a class="footref" name="fnr.2" href="#fn.2">2</a></sup>. Conventionally most of these functions included in this library end either a question mark or a star. The former are fully backtracking, while the latter don't backtrack, in order to obtain additional performance if the grammar is known to be unambiguous. There are some exceptions, most notably <code>sat</code>, which takes a predicate and returns a parsers which accepts an item for which the predicate is true, and core combinators.
</p>
</div>

</div>

<div id="outline-container-2_3" class="outline-3">
<h3 id="sec-2_3"><span class="section-number-3">2.3</span> Core combinators </h3>
<div class="outline-text-3" id="text-2_3">


<p>
The most basic elements of any grammar are sequences and alternatives. While coming from Haskell/Parsec it might seem natural to use <code>bind</code> to express the former, it is usually an overkill and due to more verbose lambda syntax in Common Lisp it is fairly clunky. For this reason <code>bind</code> is not part of the exported interface.
</p>

</div>
