doc/parser-combinators.org
*** Sequences

The basic sequence combinators are =seq-list?= and =named-seq?=, and their non-backtracking counterparts =seq-list*= and =named-seq*=. Note that, like their repetition cousins described later, the backtracking cutoff affects the argument parsers as well, at least at their top level. This means that the star variants normally shouldn't be use unless all the argument parsers are either non-backtracking or locally unambiguous as well.

The function =seq-list?= just takes a number of other parsers, and returns their results as a list. The more complex =named-seq?= macro takes a special syntax which can be used to give the elements of the sequence a name, and the final argument is a form which will be evaluated only if all parsers succeed in a scope where those names are bound to their results. The syntax of the arguments is either a raw parser, or a three element list in the form of =(<- name parser)=, where =<-= symbol is a syntactic marker.

#+BEGIN_EXAMPLE
CL-USER> (parse-string* (named-seq? (<- a "1") (<- b "2") (<- c "3") (list c a b)) "123")
(#\3 #\1 #\2)
NIL
T
NIL
#+END_EXAMPLE

An important limitation is that the names are visible only in the final, result form. Parser generating forms do not see those variables, and hence cannot depend on the results of previous parsers, other that obviously the position in the input and the fact that previous parsers all had to succeed. While this is a limitation, it makes it much easier to implement with an explicit stack, and also makes it possible to pre-initialize all argument parsers. If possible, one should use =named-seq?= or =named-seq*= for expressing basic sequences.

On the other hand it is not always possible. If the elements of a sequence do depend on the previous elements of a sequence an =MDO= macro can be used, which employs the parser monadic =bind= operation. The syntax is similar to =names-seq?= macro, except that the results *are* visible for parser creation functions which occur later in the form, and the last form is not special. The macro will return the result of the final parser, which commonly will be a parser created with =result= function, which generates a parser which consumes no input and returns its argument.

Example (using =item= parser generator function, which consumes a single item from the input and returns it):
#+BEGIN_EXAMPLE
CL-USER> (parse-string* (mdo (<- x (item)) x x x (result (format nil "4 times ~a" x))) "aaaa")
"4 times a"
NIL
T
NIL
CL-USER> (parse-string* (mdo (<- x (item)) x x x (result (format nil "4 times ~a" x))) "bbbb")
"4 times b"
NIL
T
NIL
CL-USER> (parse-string* (mdo (<- x (item)) x x x (result (format nil "4 times ~a" x))) "bbbc")
NIL
NIL
NIL
#<PARSER-COMBINATORS::CONTEXT-FRONT {BA6FB49}>
#+END_EXAMPLE

*** Alternatives

Basic alternatives are expressed using choice operators. There are four of them: =choice=, =choices=, =choice1= and =choices1=, where the plural forms are variable argument functions which reduce to their singular forms. The difference between =choice= and =choice1= is that the former will backtrack, returning both results if required, and the latter will fail if the first result is rejected. Again, use the non-backtracking form only if the arguments are unambiguous.

#+BEGIN_EXAMPLE
CL-USER> (parse-string* (choice #\a #\b) "a")
#\a
NIL
T
NIL
CL-USER> (parse-string* (choice #\a #\b) "b")
#\b
NIL
T
NIL
#+END_EXAMPLE

** Backtracking and ambiguity
With core combinators introduced in previous section, backtracking can now be explained in more detail. Backtracking is a way for parser combinators to deal with ambiguity resulting from necessity of considering context, in particular context resulting from parsing items which occur after an ambiguous pattern occurs. This method allows creation of parsers for more general grammars than many parser generators which are limited to, usually, one-character look-ahead. This of course comes with a time and memory cost, but on the other hand allows the parsers to be expressed more declaratively.

Consider an example:
#+BEGIN_EXAMPLE
CL-USER> (parse-string* (seq-list? (choice "aaa" "aa")
                                   "aaa")
                        "aaaaa")
("aa" "aaa")
#+END_EXAMPLE

Note that the first argument is ambiguous, since when looking at the input locally, both "aaa" and "aa" match the pattern. A way to make the correct choice is necessary.

What occurs here is that the first argument to =seq-list?= matches "aaa" first, then the second argument attempts to match and fails, since it runs out of letters "a". When that happens, since =seq-list?= is a backtracking parser, backtracking occurs, and other possibilities from previous parsers are considered. In this case, the first argument second choice is taken, "aa", and this allows the second argument to match, and the whole parser to succeed.

When ordering choices it is important to put the most likely possibility first, to save as much backtracking as possible. Occasionally, especially when matching literals, putting longest patterns first might be a good idea as well, if there is a possibility that some shorter ones can be a prefix of longer ones.

As mentioned above, sometimes a parser is just ambiguous and we are interested in all possible parsers. In this case the =parse-string= function is useful[fn:3]. An example:
#+BEGIN_EXAMPLE
CL-USER> (parse-string (seq-list? (choice "aaa" "aa")
                                  (choice "aaa" "aa"))
                       "aaaaa")
#<PARSER-COMBINATORS::PARSE-RESULT {B1F1061}>
#<PARSER-COMBINATORS::CONTEXT-FRONT {B1EDFF1}>
CL-USER> (defparameter *results* (gather-results *))
*RESULTS*
CL-USER> (mapcar #'tree-of *results*)
(("aaa" "aa") ("aa" "aaa") ("aa" "aa"))
CL-USER> (mapcar #'suffix-of *results*)
(#<END-CONTEXT {BB2CC41}> #<END-CONTEXT {BB2CDE9}> #<VECTOR-CONTEXT {BB2CED1}>)
#+END_EXAMPLE

The function =gather-results= takes the =parse-result= object and generates all possible results. There are also =current-result= and =next-result=, which can be used to access result sequentially. Parsing occurs lazily, so every result requires more parsing, although usually partial. Note that this means that backtracking/parsing state are not released until the =parse-result= object is garbage collected.

In this case we see that there are three possible parses, two of them consume the whole input (=suffix-of= gives the remaining input from the result, and in this case first two give =end-context=), and one has some input remaining. Having multiple results is usually not useful, but occasionally it might be desired to pick one of them by external analysis. This is also useful for testing, since this way one can see all possible backtracks that can be made from a component parser on some test input.

[fn:3] Not technically necessary, since one can call the parser manually. But why would anyone want to do that?
