doc/parser-combinators.html

<div id="outline-container-2_3_1" class="outline-4">
<h4 id="sec-2_3_1"><span class="section-number-4">2.3.1</span> Sequences </h4>
<div class="outline-text-4" id="text-2_3_1">


<p>
The basic sequence combinators are <code>seq-list?</code> and <code>named-seq?</code>, and their non-backtracking counterparts <code>seq-list*</code> and <code>named-seq*</code>. Note that, like their repetition cousins described later, the backtracking cutoff affects the argument parsers as well, at least at their top level. This means that the star variants normally shouldn't be use unless all the argument parsers are either non-backtracking or locally unambiguous as well.
</p>
<p>
The function <code>seq-list?</code> just takes a number of other parsers, and returns their results as a list. The more complex <code>named-seq?</code> macro takes a special syntax which can be used to give the elements of the sequence a name, and the final argument is a form which will be evaluated only if all parsers succeed in a scope where those names are bound to their results. The syntax of the arguments is either a raw parser, or a three element list in the form of <code>(&lt;- name parser)</code>, where <code>&lt;-</code> symbol is a syntactic marker.
</p>



<pre class="example">CL-USER&gt; (parse-string* (named-seq? (&lt;- a "1") (&lt;- b "2") (&lt;- c "3") (list c a b)) "123")
(#\3 #\1 #\2)
NIL
T
NIL
</pre>



<p>
An important limitation is that the names are visible only in the final, result form. Parser generating forms do not see those variables, and hence cannot depend on the results of previous parsers, other that obviously the position in the input and the fact that previous parsers all had to succeed. While this is a limitation, it makes it much easier to implement with an explicit stack, and also makes it possible to pre-initialize all argument parsers. If possible, one should use <code>named-seq?</code> or <code>named-seq*</code> for expressing basic sequences.
</p>
<p>
On the other hand it is not always possible. If the elements of a sequence do depend on the previous elements of a sequence an <code>MDO</code> macro can be used, which employs the parser monadic <code>bind</code> operation. The syntax is similar to <code>names-seq?</code> macro, except that the results <b>are</b> visible for parser creation functions which occur later in the form, and the last form is not special. The macro will return the result of the final parser, which commonly will be a parser created with <code>result</code> function, which generates a parser which consumes no input and returns its argument.
</p>
<p>
Example (using <code>item</code> parser generator function, which consumes a single item from the input and returns it):
</p>


<pre class="example">CL-USER&gt; (parse-string* (mdo (&lt;- x (item)) x x x (result (format nil "4 times ~a" x))) "aaaa")
"4 times a"
NIL
T
NIL
CL-USER&gt; (parse-string* (mdo (&lt;- x (item)) x x x (result (format nil "4 times ~a" x))) "bbbb")
"4 times b"
NIL
T
NIL
CL-USER&gt; (parse-string* (mdo (&lt;- x (item)) x x x (result (format nil "4 times ~a" x))) "bbbc")
NIL
NIL
NIL
#&lt;PARSER-COMBINATORS::CONTEXT-FRONT {BA6FB49}&gt;
</pre>



</div>

</div>

<div id="outline-container-2_3_2" class="outline-4">
<h4 id="sec-2_3_2"><span class="section-number-4">2.3.2</span> Alternatives </h4>
<div class="outline-text-4" id="text-2_3_2">


<p>
Basic alternatives are expressed using choice operators. There are four of them: <code>choice</code>, <code>choices</code>, <code>choice1</code> and <code>choices1</code>, where the plural forms are variable argument functions which reduce to their singular forms. The difference between <code>choice</code> and <code>choice1</code> is that the former will backtrack, returning both results if required, and the latter will fail if the first result is rejected. Again, use the non-backtracking form only if the arguments are unambiguous.
</p>



<pre class="example">CL-USER&gt; (parse-string* (choice #\a #\b) "a")
#\a
NIL
T
NIL
CL-USER&gt; (parse-string* (choice #\a #\b) "b")
#\b
NIL
T
NIL
</pre>



</div>
</div>

</div>

<div id="outline-container-2_4" class="outline-3">
<h3 id="sec-2_4"><span class="section-number-3">2.4</span> Backtracking and ambiguity </h3>
<div class="outline-text-3" id="text-2_4">

<p>With core combinators introduced in previous section, backtracking can now be explained in more detail. Backtracking is a way for parser combinators to deal with ambiguity resulting from necessity of considering context, in particular context resulting from parsing items which occur after an ambiguous pattern occurs. This method allows creation of parsers for more general grammars than many parser generators which are limited to, usually, one-character look-ahead. This of course comes with a time and memory cost, but on the other hand allows the parsers to be expressed more declaratively.
</p>
<p>
Consider an example:
</p>


<pre class="example">CL-USER&gt; (parse-string* (seq-list? (choice "aaa" "aa")
                                   "aaa")
                        "aaaaa")
("aa" "aaa")
</pre>



<p>
Note that the first argument is ambiguous, since when looking at the input locally, both "aaa" and "aa" match the pattern. A way to make the correct choice is necessary.
</p>
<p>
What occurs here is that the first argument to <code>seq-list?</code> matches "aaa" first, then the second argument attempts to match and fails, since it runs out of letters "a". When that happens, since <code>seq-list?</code> is a backtracking parser, backtracking occurs, and other possibilities from previous parsers are considered. In this case, the first argument second choice is taken, "aa", and this allows the second argument to match, and the whole parser to succeed.
</p>
<p>
When ordering choices it is important to put the most likely possibility first, to save as much backtracking as possible. Occasionally, especially when matching literals, putting longest patterns first might be a good idea as well, if there is a possibility that some shorter ones can be a prefix of longer ones.
</p>
<p>
As mentioned above, sometimes a parser is just ambiguous and we are interested in all possible parsers. In this case the <code>parse-string</code> function is useful<sup><a class="footref" name="fnr.3" href="#fn.3">3</a></sup>. An example:
</p>


<pre class="example">CL-USER&gt; (parse-string (seq-list? (choice "aaa" "aa")
                                  (choice "aaa" "aa"))
                       "aaaaa")
#&lt;PARSER-COMBINATORS::PARSE-RESULT {B1F1061}&gt;
#&lt;PARSER-COMBINATORS::CONTEXT-FRONT {B1EDFF1}&gt;
CL-USER&gt; (defparameter *results* (gather-results *))
*RESULTS*
CL-USER&gt; (mapcar #'tree-of *results*)
(("aaa" "aa") ("aa" "aaa") ("aa" "aa"))
CL-USER&gt; (mapcar #'suffix-of *results*)
(#&lt;END-CONTEXT {BB2CC41}&gt; #&lt;END-CONTEXT {BB2CDE9}&gt; #&lt;VECTOR-CONTEXT {BB2CED1}&gt;)
</pre>



<p>
The function <code>gather-results</code> takes the <code>parse-result</code> object and generates all possible results. There are also <code>current-result</code> and <code>next-result</code>, which can be used to access result sequentially. Parsing occurs lazily, so every result requires more parsing, although usually partial. Note that this means that backtracking/parsing state are not released until the <code>parse-result</code> object is garbage collected.
</p>
<p>
In this case we see that there are three possible parses, two of them consume the whole input (<code>suffix-of</code> gives the remaining input from the result, and in this case first two give <code>end-context</code>), and one has some input remaining. Having multiple results is usually not useful, but occasionally it might be desired to pick one of them by external analysis. This is also useful for testing, since this way one can see all possible backtracks that can be made from a component parser on some test input.
</p></div>

</div>
