doc/parser-combinators.org
** Repetition combinators

From those core combinators more complex combinators can be constructed[fn:4]. Most basic of those are repetition combinators, which take a parser and perhaps some additional information and return a sequence of matches. Most general repetition operators are =between?= and =breadth?=. They both take a parser, a minimal and maximal number of occurrences, either of which can be =nil=, and optionally a type of the result sequence (a list by default).

[fn:4] Although many built-in combinators are implemented manually with an explicit stack for performance reasons.

The difference between them is that =between?= will attempt to consume as many matches as possible, unless forced otherwise by backtracking, while =breadth?= will attempt to consume as few as possible, again, unless forced otherwise by backtracking. In most cases the former is more useful. Usually, more specific forms should be used, like =opt?=, =many?=, =many1?=, =times?=, =atleast?= and =atmost?=. See their docstrings for details, but they are fairly obvious specializations. Those have a non-backtracking versions, except obviously =breadth?=, but the same note as with sequence combinators matters, only the first result of the argument parser will ever be used.

** Token parsers
There are some predefined parsers for common tokens. See their docstrings for details. The built in token parsers are: =digit?=, =lower?=, =upper?=, =letter?=, =alphanum?=, =whitespace?=, =word?=, =nat?=, =int?=, =quoted?=. Most of those have non-backtracking versions.

** Structured repetition
There are some built-in parsers which proved some common repetition patterns. If there are any other general and common patters, please submit them. The preexisting ones are =sepby1?=, =sepby?= and =bracket?=. Example:

#+BEGIN_EXAMPLE
CL-USER> (parse-string* (bracket? #\[ (sepby? (int?) #\,) #\])
               "[17,22,34]")
(17 22 34)
NIL
T
NIL
#+END_EXAMPLE

** Finding
Sometimes it is desirable to skip part of the input string until a match can be found. The =find?= family of parser combinators achieves this. The most basic is =find?= itself, which skips input until a match can be found. The =find-after?= will only skip patterns given by its first argument, and the return the result of the second argument parser. The =find-after-collect?= will collect the skipped items and cons them to the result of the primary parser. The =find-before?= will collect the skipped items, and return them as a sequence, ignoring the second argument. That is useful if the terminator is part of some other pattern.
** Bulk repetition
While in principle similar to non-backtracking =find?= versions (which also exists), there is a set of =gather= combinators, which are not only non-backtracking, but also specialized on input from. This makes them faster, but limited. The =gather-before-token*=, =gather-if*= and =gather-if-not*= operate on input sequence element level and so can traverse it without using the normally necessary context instrumentation. This can be a significant performance gain for recognizing bulk data delimited by single element terminator.
** Chains
A more complex form of structured repetition are chains. Combinators =chainl1?= and =chainr1?= take an item parser, and an operator parser, which should return a function which will be used to reduce the sequence. The former applies the reduction with left associativity, and the latter with right associativity. The most basic application is to transform an infix operators to prefix operators. The file =test-arithmetic= shows how to use this to parse basic arithmetic expressions. This [[https://gist.github.com/784387][gist]] shows an example where the =chainl1?= operator is used to merge graphs representing molecule fragments in SMILES language.
** Expressions
The generalization of chains is =expression?= parser generator, which can create a parser for recursive expressions with multiple operators with different associativity and subexpressions. See the =test-expression.lisp= file for example of simple arithmetic parser.
** Recursion and parser initialization
The library attempts to initialize the parsers as much as possible when they are created. This includes constructing all subparsers. This is a problem for recursive parsers, since it will cause an infinite recursion in the parser construction stage. If no built-in structured combinators fits the problem, there are two ways to solve this.

One is to delay the construction of the parser until it is needed. This can also be useful if the parser requires significant precomputation and might not be used. This can achieved either by using =delayed?= macro, or as a non-first argument to =mdo=.

The other method introduces an indirection, which allows the recursive parser to be initialized once. The =named?= macro will give a name to its body, which then can be passed and called at some lower level. Once more, this [[https://gist.github.com/784387][gist]] shows an example. While this requires passing the recursive parser as an argument to the point where it is used, this saves the cost of recreating the parser multiple times and makes the recursion explicit, so it is a preferred approach.
* Other concepts
** Primitive parsers

=(zero)= is a parser generator for a parser which represents a parsing failure

=(result v)= is a parser generator for a parser which doesn't modify the input and returns =v=

=(item)= is a parser generator for a parser which consumes and returns one item from the input

** Backtracking
*** Modifiers
Modifier =force?= makes a parser which is identical to its argument, but is fully executed, that is, does not perform further parsing lazily.

Modifier =cut?= discards all the results but the first, preventing backtracking.
** Contexts

The context protocol is used to abstract the input sequence. Vectors and lists are fully implemented. Unless handlers for new types of input are desired, this is not usually relevant to end users.

*** Context intervals
A part of context protocol that might be most useful to the end user of the library are the =context-interval= method and the =context?= parser generator, which consumes no input and captures context of the point. By capturing two such contexts and using =context-interval= a subsequence can be located efficiently. This is useful if a pattern is relevant only for recognition, and not actual parsing.
