doc/parser-combinators.html

<div id="outline-container-2_5" class="outline-3">
<h3 id="sec-2_5"><span class="section-number-3">2.5</span> Repetition combinators </h3>
<div class="outline-text-3" id="text-2_5">


<p>
From those core combinators more complex combinators can be constructed<sup><a class="footref" name="fnr.4" href="#fn.4">4</a></sup>. Most basic of those are repetition combinators, which take a parser and perhaps some additional information and return a sequence of matches. Most general repetition operators are <code>between?</code> and <code>breadth?</code>. They both take a parser, a minimal and maximal number of occurrences, either of which can be <code>nil</code>, and optionally a type of the result sequence (a list by default).
</p>
<p>
The difference between them is that <code>between?</code> will attempt to consume as many matches as possible, unless forced otherwise by backtracking, while <code>breadth?</code> will attempt to consume as few as possible, again, unless forced otherwise by backtracking. In most cases the former is more useful. Usually, more specific forms should be used, like <code>opt?</code>, <code>many?</code>, <code>many1?</code>, <code>times?</code>, <code>atleast?</code> and <code>atmost?</code>. See their docstrings for details, but they are fairly obvious specializations. Those have a non-backtracking versions, except obviously <code>breadth?</code>, but the same note as with sequence combinators matters, only the first result of the argument parser will ever be used.
</p>
</div>

</div>

<div id="outline-container-2_6" class="outline-3">
<h3 id="sec-2_6"><span class="section-number-3">2.6</span> Token parsers </h3>
<div class="outline-text-3" id="text-2_6">

<p>There are some predefined parsers for common tokens. See their docstrings for details. The built in token parsers are: <code>digit?</code>, <code>lower?</code>, <code>upper?</code>, <code>letter?</code>, <code>alphanum?</code>, <code>whitespace?</code>, <code>word?</code>, <code>nat?</code>, <code>int?</code>, <code>quoted?</code>. Most of those have non-backtracking versions.
</p>
</div>

</div>

<div id="outline-container-2_7" class="outline-3">
<h3 id="sec-2_7"><span class="section-number-3">2.7</span> Structured repetition </h3>
<div class="outline-text-3" id="text-2_7">

<p>There are some built-in parsers which proved some common repetition patterns. If there are any other general and common patters, please submit them. The preexisting ones are <code>sepby1?</code>, <code>sepby?</code> and <code>bracket?</code>. Example:
</p>



<pre class="example">CL-USER&gt; (parse-string* (bracket? #\[ (sepby? (int?) #\,) #\])
               "[17,22,34]")
(17 22 34)
NIL
T
NIL
</pre>



</div>

</div>

<div id="outline-container-2_8" class="outline-3">
<h3 id="sec-2_8"><span class="section-number-3">2.8</span> Finding </h3>
<div class="outline-text-3" id="text-2_8">

<p>Sometimes it is desirable to skip part of the input string until a match can be found. The <code>find?</code> family of parser combinators achieves this. The most basic is <code>find?</code> itself, which skips input until a match can be found. The <code>find-after?</code> will only skip patterns given by its first argument, and the return the result of the second argument parser. The <code>find-after-collect?</code> will collect the skipped items and cons them to the result of the primary parser. The <code>find-before?</code> will collect the skipped items, and return them as a sequence, ignoring the second argument. That is useful if the terminator is part of some other pattern.
</p></div>

</div>

<div id="outline-container-2_9" class="outline-3">
<h3 id="sec-2_9"><span class="section-number-3">2.9</span> Bulk repetition </h3>
<div class="outline-text-3" id="text-2_9">

<p>While in principle similar to non-backtracking <code>find?</code> versions (which also exists), there is a set of <code>gather</code> combinators, which are not only non-backtracking, but also specialized on input from. This makes them faster, but limited. The <code>gather-before-token*</code>, <code>gather-if*</code> and <code>gather-if-not*</code> operate on input sequence element level and so can traverse it without using the normally necessary context instrumentation. This can be a significant performance gain for recognizing bulk data delimited by single element terminator.
</p></div>

</div>

<div id="outline-container-2_10" class="outline-3">
<h3 id="sec-2_10"><span class="section-number-3">2.10</span> Chains </h3>
<div class="outline-text-3" id="text-2_10">

<p>A more complex form of structured repetition are chains. Combinators <code>chainl1?</code> and <code>chainr1?</code> take an item parser, and an operator parser, which should return a function which will be used to reduce the sequence. The former applies the reduction with left associativity, and the latter with right associativity. The most basic application is to transform an infix operators to prefix operators. The file <code>test-arithmetic</code> shows how to use this to parse basic arithmetic expressions. This <a href="https://gist.github.com/784387">gist</a> shows an example where the <code>chainl1?</code> operator is used to merge graphs representing molecule fragments in SMILES language.
</p></div>

</div>

<div id="outline-container-2_11" class="outline-3">
<h3 id="sec-2_11"><span class="section-number-3">2.11</span> Expressions </h3>
<div class="outline-text-3" id="text-2_11">

<p>The generalization of chains is <code>expression?</code> parser generator, which can create a parser for recursive expressions with multiple operators with different associativity and subexpressions. See the <code>test-expression.lisp</code> file for example of simple arithmetic parser.
</p></div>

</div>

<div id="outline-container-2_12" class="outline-3">
<h3 id="sec-2_12"><span class="section-number-3">2.12</span> Recursion and parser initialization </h3>
<div class="outline-text-3" id="text-2_12">

<p>The library attempts to initialize the parsers as much as possible when they are created. This includes constructing all subparsers. This is a problem for recursive parsers, since it will cause an infinite recursion in the parser construction stage. If no built-in structured combinators fits the problem, there are two ways to solve this.
</p>
<p>
One is to delay the construction of the parser until it is needed. This can also be useful if the parser requires significant precomputation and might not be used. This can achieved either by using <code>delayed?</code> macro, or as a non-first argument to <code>mdo</code>.
</p>
<p>
The other method introduces an indirection, which allows the recursive parser to be initialized once. The <code>named?</code> macro will give a name to its body, which then can be passed and called at some lower level. Once more, this <a href="https://gist.github.com/784387">gist</a> shows an example. While this requires passing the recursive parser as an argument to the point where it is used, this saves the cost of recreating the parser multiple times and makes the recursion explicit, so it is a preferred approach.
</p></div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Other concepts </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><span class="section-number-3">3.1</span> Primitive parsers </h3>
<div class="outline-text-3" id="text-3_1">


<p>
<code>(zero)</code> is a parser generator for a parser which represents a parsing failure
</p>
<p>
<code>(result v)</code> is a parser generator for a parser which doesn't modify the input and returns <code>v</code>
</p>
<p>
<code>(item)</code> is a parser generator for a parser which consumes and returns one item from the input
</p>
</div>

</div>

<div id="outline-container-3_2" class="outline-3">
<h3 id="sec-3_2"><span class="section-number-3">3.2</span> Backtracking </h3>
<div class="outline-text-3" id="text-3_2">


</div>

<div id="outline-container-3_2_1" class="outline-4">
<h4 id="sec-3_2_1"><span class="section-number-4">3.2.1</span> Modifiers </h4>
<div class="outline-text-4" id="text-3_2_1">

<p>Modifier <code>force?</code> makes a parser which is identical to its argument, but is fully executed, that is, does not perform further parsing lazily.
</p>
<p>
Modifier <code>cut?</code> discards all the results but the first, preventing backtracking.
</p></div>
</div>

</div>

<div id="outline-container-3_3" class="outline-3">
<h3 id="sec-3_3"><span class="section-number-3">3.3</span> Contexts </h3>
<div class="outline-text-3" id="text-3_3">


<p>
The context protocol is used to abstract the input sequence. Vectors and lists are fully implemented. Unless handlers for new types of input are desired, this is not usually relevant to end users.
</p>

</div>

<div id="outline-container-3_3_1" class="outline-4">
<h4 id="sec-3_3_1"><span class="section-number-4">3.3.1</span> Context intervals </h4>
<div class="outline-text-4" id="text-3_3_1">

<p>A part of context protocol that might be most useful to the end user of the library are the <code>context-interval</code> method and the <code>context?</code> parser generator, which consumes no input and captures context of the point. By capturing two such contexts and using <code>context-interval</code> a subsequence can be located efficiently. This is useful if a pattern is relevant only for recognition, and not actual parsing.
</p></div>
</div>

</div>
